<a href="https://colab.research.google.com/github/Sriram-764/FML/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install pandas

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
a = pd.Series([1,2,3,4])
print(a)
#series can be mutable
a[3] = 5
print(a)
#creating a series from a numpy array
fruits=np.array(['banana','mango','coconut'])
print(fruits)
#series can be mutable
series = pd.Series(fruits)
print(series)
series[0] = 'apple'
print(series)

In [ ]:
#DataFrames
#syntax : pd.DataFrame({}->dictionary)
#Example
df1 = pd.DataFrame({
    "SNO" : [1,2,3,4,5],
    "NAME" : ['Sriram','Uday','Karthik','Charan','Gopi'],
    "MARKS" : [81,87,75,89,99]
})
print(df1)

In [ ]:
mylist = ([4, 8, 12, 16, 20])
df2 = pd.DataFrame(mylist)
print(df2)

grocery = np.array([['Rice',1000],['Biscuits',50],['Chocolates',40]])
data_frame = pd.DataFrame(grocery,columns=['Product','price'])
print(data_frame)

In [ ]:
data_frame.describe()

In [33]:
read_data_set = pd.read_csv('cars.csv')

In [ ]:
read_data_set.describe()

In [43]:
read_data_set.head() #returns first five(default) rows of the data set

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [ ]:
read_data_set.tail() #returns last five(default) rows of the data set

In [ ]:
read_data_set.head(10) #return first 10 rows of the data set

In [ ]:
read_data_set['color']

In [ ]:
read_data_set.loc[[1,4,7],['brand','color']]

In [ ]:
 #we can also use slicing for index values
read_data_set.loc[:5,['brand','color']]

In [85]:
#Data Wrangling
#Merging
d1 = pd.DataFrame({
    "Register_no" : ['21PA1A0519','21PA1A0518','21PA1A0514','21PA1A0524'],
    "Student_Name" : ['Sriram','Uday','Akhil','Pavan']
})
d2 = pd.DataFrame({
    "Register_no": ['21PA1A0519','21P1A1A0531','21PA1A0533'],
    "Student_Name" : ['Sriram','Gopi','Poorna']
})

In [ ]:
pd.merge(d1,d2) #can be merged if there is a common data

In [81]:
raw = {
    'Name': ['John', 'John', 'Grace', 'Grace', 'Benjamin', 'Benjamin', 'Benjamin',
        'Benjamin', 'John', 'Alex', 'Alex', 'Alex'],
    'Position': [2, 1, 1, 4, 2, 4, 3, 1, 3, 2, 4, 3],
    'Year': [2009, 2010, 2009, 2010, 2010, 2010, 2011, 2012, 2011, 2013, 2013, 2012],
    'Marks':[408, 398, 422, 376, 401, 380, 396, 388, 356, 402, 368, 378]
}
df3 = pd.DataFrame(raw)

In [ ]:
df3.groupby('Year')